# Семинар 1
# Задача 1
# a = int(input('Введите 1 число: '))
# b = int(input('Введите 2 число: '))
# if a**2 == b:
#     print('Второе число является квадратом первого')
# else:
#     print('Второе число не является квадратом первого')

# Задача 2
list = input('Введите 5 любых чисел: ')
listA = [list]
a = int(max(list))
print(a)
