# Семинар 1
# Задача 1
# a = int(input('Введите 1 число: '))
# b = int(input('Введите 2 число: '))
# if a**2 == b:
#     print('Второе число является квадратом первого')
# else:
#     print('Второе число не является квадратом первого')

# Задача 2 - НЕ СМОГ РЕШИТЬ, МОЖЕТЕ ОБЪЯСНИТЬ, ПОЖАЛУЙСТА
# list = input('Введите 5 любых чисел: ')
# listA = [list]
# a = int(max(list))
# print(a)

# Задача 3
# a = int(input('Введите 1 число: '))
# for i in range(-a, a):
#     print(i)

# Задача 4
# a = float(input('Введите число: '))
# b = int(str(abs(a))[0])
# print(b)

# Задача 5 - РЕШИЛ, НО НЕ ДО КОНЦА. НУЖНА ПОМОЩЬ
# a = int(input('Введите число: '))
# x = (a % 5 == 0) and (a % (10 or 15) == 0)
# z = not (a % 30 == 0)
# if ((x and z) is True):
#     print('Все условия совпадают')
# else:
#     print('Одно или несколько условий не совподают')

# Задание 6 - РЕШИЛ, НО МНЕ КАЖТСЯ, ЧТО ЕСТЬ БОЛЕЕ ОПТИМАЛЬНЫЙ СПОСОБ
# a = int(input('Введите число от 1 до 7: '))
# b = 6
# c = 7
# if (a == b):
#     print(a, ' - выходной!!!')
# elif (a == c):
#     print(a, ' - выходной!!!')
# else:
#     print(a, ' - cерые будни')
